; domain
(define (domain maze)
(:predicates
	 (at ?p ?t) (person ?p) (empty ?x) (wall ?x) (north ?a ?b) (south ?a ?b) (west ?a ?b) (east ?a ?b))

(:action move-north
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (north ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))
(:action move-south
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (south ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))
(:action move-west
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (west ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))
(:action move-east
 :parameters ( ?p ?a ?b)
 :precondition
	(and (person ?p) (empty ?b) (at ?p ?a)  (east ?a ?b))
 :effect
	(and (at ?p ?b) (not (at ?p ?a))))


)

; problem
(define (problem simple_maze)
    (:domain  maze)
    (:objects
        
	g3
	g2
	g1
	g0
	goal_tile
	start_tile
	d4
	person1
	c3
	c2
	c1
	c0
	d2
	d3
	d0
	d1)
(:init
	(south d1 d2)
	(south c3 d0)
	(south g1 g0)
	(south g3 g2)
	(south g0 c3)
	(south d2 d3)
	(south g2 g1)
	(south d0 d1)
	(south goal_tile g3)
	(south d3 d4)
	(north g2 g3)
	(north g3 goal_tile)
	(north c3 g0)
	(north d4 d3)
	(north d2 d1)
	(north d3 d2)
	(north d1 d0)
	(north g0 g1)
	(north d0 c3)
	(north g1 g2)
	(west c2 c1)
	(west c3 c2)
	(west c1 c0)
	(west c0 start_tile)
	(person person1)
	(at person1 start_tile)
	(east c0 c1)
	(east c2 c3)
	(east c1 c2)
	(east start_tile c0)
	(empty c1)
	(empty c0)
	(empty d2)
	(empty d4)
	(empty d3)
	(empty d0)
	(empty goal_tile)
	(empty g3)
	(empty d1)
	(empty g2)
	(empty g1)
	(empty g0)
	(empty start_tile)
	(empty c3)
	(empty c2)
            )
    (:goal
        (and (at person1 goal_tile))
        )
    )

; plan
1. (move-east person1 start_tile c0)
   deleted: (at person1 start_tile)
   added: (at person1 c0)
   goals met: 0 of 1
2. (move-east person1 c0 c1)
   deleted: (at person1 c0)
   added: (at person1 c1)
   goals met: 0 of 1
3. (move-east person1 c1 c2)
   deleted: (at person1 c1)
   added: (at person1 c2)
   goals met: 0 of 1
4. (move-east person1 c2 c3)
   deleted: (at person1 c2)
   added: (at person1 c3)
   goals met: 0 of 1
5. (move-north person1 c3 g0)
   deleted: (at person1 c3)
   added: (at person1 g0)
   goals met: 0 of 1
6. (move-north person1 g0 g1)
   deleted: (at person1 g0)
   added: (at person1 g1)
   goals met: 0 of 1
7. (move-north person1 g1 g2)
   deleted: (at person1 g1)
   added: (at person1 g2)
   goals met: 0 of 1
8. (move-north person1 g2 g3)
   deleted: (at person1 g2)
   added: (at person1 g3)
   goals met: 0 of 1
9. (move-north person1 g3 goal_tile)
   deleted: (at person1 g3)
   added: (at person1 goal_tile)
   goals met: 1 of 1
